### Importacion de Librerias

In [ ]:
import pandas as pd
import numpy as np

### Importacion de los datos

In [ ]:
raw_csv_data = pd.read_csv("Index_united.csv")
df_comp=raw_csv_data.copy()

### Limpieza de los datos

In [ ]:
#Muestra de las columnas del dataframe
df_comp.columns
df_comp.drop(columns='Unnamed: 0',inplace=True)

#### Conversion de los datos de la columna **date** en formato fecha

In [ ]:
from datetime import datetime

date_string = "13/01/1994"
format = "%d/%m/%Y"

try:
    date = datetime.strptime(date_string, format)
    print(date)
except ValueError as e:
    print("Error:", e)

1994-01-13 00:00:00

### Tama√±o del tiempo de la data

In [ ]:
df_comp.describe()## Observacion de los momentos muestrales de cada serie de los precios de cada columna

               spx           dax         ftse        nikkei
count  7752.000000   7752.000000  7752.000000   7752.000000
mean   1723.576196   7498.407811  5748.635567  16649.531575
std    1040.265768   3893.125784  1251.664602   5794.663737
min     438.920000   1911.700000  2876.600000   7054.980000
25%    1085.027500   4495.042500  4904.747500  11359.932500
50%    1330.646624   6494.305000  5925.315000  16413.775000
75%    2106.682447  10676.682500  6695.818232  20224.452500
max    4796.560059  16469.750000  8014.299805  33753.328125

In [ ]:
df_comp.head()##Primeros registros de la data

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [ ]:
df_comp.date.describe()  ##Momentos muestrales de la serie date

count           7752
unique          7752
top       07/01/1994
freq               1
Name: date, dtype: object

In [ ]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [ ]:
df_comp.date.describe()

count           7752
unique          7752
top       07/01/1994
freq               1
Name: date, dtype: object

### Conversion de la columna object a Datetime

In [ ]:
df_comp.date=pd.to_datetime(df_comp.date,dayfirst=True)

In [ ]:
df_comp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7752 entries, 0 to 7751
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    7752 non-null   datetime64[ns]
 1   spx     7752 non-null   float64
 2   dax     7752 non-null   float64
 3   ftse    7752 non-null   float64
 4   nikkei  7752 non-null   float64
dtypes: datetime64[ns](1), float64(4)
memory usage: 302.9 KB

### Marcando el indice de cada cotizacion

In [ ]:
df_comp.set_index("date")

                    spx           dax         ftse        nikkei
date
1994-01-07   469.900000   2224.950000  3445.980000  18124.010000
1994-01-10   475.270000   2225.000000  3440.580000  18443.440000
1994-01-11   474.130000   2228.100000  3413.770000  18485.250000
1994-01-12   474.170000   2182.060000  3372.020000  18793.880000
1994-01-13   472.470000   2142.370000  3360.010000  18577.260000
...                 ...           ...          ...           ...
2023-10-04  4263.750000  15099.919922  7412.500000  30526.880859
2023-10-05  4258.189941  15070.219727  7451.500000  31075.359375
2023-10-06  4308.500000  15229.769531  7494.600098  30994.669922
2023-10-09  4335.660156  15128.110352  7492.200195  30994.669922
2023-10-10  4358.240234  15423.519531  7628.200195  31746.529297

[7752 rows x 4 columns]

In [ ]:
df_comp.set_index("date", inplace=True) #Sitiando sobre la misma variable

In [ ]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

#### Base de datos guardada

In [ ]:
df_comp.to_csv('Index_modified.csv')

### Muestra de frecuencia preferida

In [ ]:
df_compd=df_comp.asfreq('d') ##Freecuencia diaria

In [ ]:
df_compd.shape

(10869, 4)

In [ ]:
df_compb=df_comp.asfreq('b') # Frecuencia bimestral

In [ ]:
df_compb.head() ## Primeros registros

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missing Values

In [ ]:
df_compb.isna() ## Verificaion de nulos en el dataframe

             spx   dax  ftse  nikkei
date
1996-01-01  True  True  True    True
1996-01-02  True  True  True    True
1996-01-03  True  True  True    True
1996-01-04  True  True  True    True
1996-01-05  True  True  True    True
...          ...   ...   ...     ...
2015-12-25  True  True  True    True
2015-12-28  True  True  True    True
2015-12-29  True  True  True    True
2015-12-30  True  True  True    True
2015-12-31  True  True  True    True

[5219 rows x 4 columns]

In [ ]:
df_compb.isna().sum() ##Suma de los datos nulos del dataframe de cada columna

spx       5219
dax       5219
ftse      5219
nikkei    5219
dtype: int64

In [ ]:
df_compb

            spx  dax  ftse  nikkei
date
1996-01-01  NaN  NaN   NaN     NaN
1996-01-02  NaN  NaN   NaN     NaN
1996-01-03  NaN  NaN   NaN     NaN
1996-01-04  NaN  NaN   NaN     NaN
1996-01-05  NaN  NaN   NaN     NaN
...         ...  ...   ...     ...
2015-12-25  NaN  NaN   NaN     NaN
2015-12-28  NaN  NaN   NaN     NaN
2015-12-29  NaN  NaN   NaN     NaN
2015-12-30  NaN  NaN   NaN     NaN
2015-12-31  NaN  NaN   NaN     NaN

[5219 rows x 4 columns]

In [ ]:
##Imputacion  de datos sobre los datos nulos de manera que reemplazar√° los valores faltantes con el valor de la fila anterior en la misma columna
df_comp.spx=df_comp.spx.fillna(method='ffill')

NameError: name 'df_comp' is not defined

In [ ]:
df_comp.isna().sum()#Suma de datos nulos

spx       5219
dax       5219
ftse      5219
nikkei    5219
dtype: int64

In [ ]:
##Imputacion  de datos sobre los datos nulos de manera queque reemplazar√° los valores faltantes con el valor de la fila siguiente en la misma columna.
df_comp.ftse=df_comp.ftse.fillna(method='bfill')

In [ ]:
##Imputacion  de datos sobre los datos nulos de manera queque reemplazar√° los valores faltantes con el valor de la media
df_comp.dax=df_comp.dax.fillna(value = df_comp.dax.mean())

### Simplificando los datos

In [ ]:
## Nuevaa Variable **market_value** (capitakizacion de mercado) o activo corresponde al indice **GSPC**
df_comp['market_value']=df_comp.spx

In [ ]:
df_comp.describe()

       spx  dax  ftse  nikkei  market_value
count  0.0  0.0   0.0     0.0           0.0
mean   NaN  NaN   NaN     NaN           NaN
std    NaN  NaN   NaN     NaN           NaN
min    NaN  NaN   NaN     NaN           NaN
25%    NaN  NaN   NaN     NaN           NaN
50%    NaN  NaN   NaN     NaN           NaN
75%    NaN  NaN   NaN     NaN           NaN
max    NaN  NaN   NaN     NaN           NaN

In [ ]:
del df_comp['spx'] # Eliminacion original de los datos de GSPC

In [ ]:
df_comp.describe() # Descripcion de los datos

       dax  ftse  nikkei  market_value
count  0.0   0.0     0.0           0.0
mean   NaN   NaN     NaN           NaN
std    NaN   NaN     NaN           NaN
min    NaN   NaN     NaN           NaN
25%    NaN   NaN     NaN           NaN
50%    NaN   NaN     NaN           NaN
75%    NaN   NaN     NaN           NaN
max    NaN   NaN     NaN           NaN

In [ ]:
# Eliminacion original de los datos de cada indice
del df_comp['dax']
del df_comp['ftse']
del df_comp['nikkei']

In [ ]:
df_comp.describe()

       market_value
count           0.0
mean            NaN
std             NaN
min             NaN
25%             NaN
50%             NaN
75%             NaN
max             NaN

### Separacion de la data en train y test

In [ ]:
size = int(len(df_comp)*0.8) #Separacion de data original en d_test y df = df_train donde se podra pobrar la eficacia de los modelos para entrenar y predecir nuevos datos

In [ ]:
df = df_comp.iloc[:size]

In [ ]:
df_test = df_comp.iloc[size:]

In [ ]:
df.tail()

                    spx       dax         ftse    nikkei
date
2017-10-18  2561.264453  13043.03  7542.866979  21363.05
2017-10-19  2562.103755  12990.10  7523.038195  21448.52
2017-10-20  2575.205878  12991.28  7523.225958  21457.64
2017-10-23  2564.978524  13003.14  7524.452244  21696.65
2017-10-24  2569.134260  13013.19  7526.543117  21805.17

In [ ]:
df_test.head()

                    spx       dax         ftse    nikkei
date
2017-10-25  2557.150985  12953.41  7447.212942  21707.62
2017-10-26  2560.399195  13133.28  7486.499169  21739.78
2017-10-27  2581.065703  13217.54  7505.029789  22008.45
2017-10-30  2572.833603  13229.57  7487.812147  22011.67
2017-10-31  2575.263830  13229.57  7493.078749  22011.61